# Коментарии

age = 25  # Инициализация переменной int()
print('Возраст: ' + str(age))  # Вывод переменной age
print('Возраст:', age)  # Вывод переменной age с другого угла

temp = 5.9  # Инициализация переменной float()
print('Температура:', temp, 'градусов.')  # Вывод переменной temp

username = 'Алекс'  # Инициализация переменной str()
print('Имя пользователя:', username);
print('Имя пользователя:', username)  # Вывод для примера набора в одну строку.

sex = True  # Инициализация переменной bool()
print('Существует:', sex)  # Вывод переменной sex
sex = False  # Изменение переменной sex
print('Существует:', sex)  # Вывод переменной sex

age = '18.5'  # Изменение переменной age
print('Возраст: ' + age)  # Вывод переменной age

'''Применение функции type() по отношению к переменным с целью определения типа (класса) переменных
и показа работы подобия многострокового коментирования.'''
print('Тип переменной age:', type(age))
print('Тип переменной temp:', type(temp))
print('Тип переменной username:', type(username))
print('Тип переменной 25:', type(25))

# Пример переноса строки в переменной используя тройные кавычки, осуществляется по Enter.
text = '''Первая строка
Вторая строка и конечно
Третья строка'''
print(text)

# Домашнее задание - это всё закоментировать.
